CoreMaker-lab/STM32C542CC_AIS2IH/STM32C542CC_AISIHTR_Project1/STM32C542CC_AISIHTR_Project1_cmake/ais2ih_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t ais2ih_read_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                        uint8_t *data,
                        uint16_t len);
int32_t ais2ih_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                         uint8_t *data,
                         uint16_t len);

float_t ais2ih_from_fs2_to_mg(int16_t lsb);
float_t ais2ih_from_fs4_to_mg(int16_t lsb);
float_t ais2ih_from_fs8_to_mg(int16_t lsb);
float_t ais2ih_from_fs16_to_mg(int16_t lsb);

float_t ais2ih_from_fs2_lp1_to_mg(int16_t lsb);
float_t ais2ih_from_fs4_lp1_to_mg(int16_t lsb);
float_t ais2ih_from_fs8_lp1_to_mg(int16_t lsb);
float_t ais2ih_from_fs16_lp1_to_mg(int16_t lsb);

float_t ais2ih_from_lsb_to_celsius(int16_t lsb);

typedef enum
{
  AIS2IH_HIGH_PERFORMANCE                    = 0x04,
  AIS2IH_CONT_LOW_PWR_4                      = 0x03,
  AIS2IH_CONT_LOW_PWR_3                      = 0x02,
  AIS2IH_CONT_LOW_PWR_2                      = 0x01,
  AIS2IH_CONT_LOW_PWR_12bit                  = 0x00,
  AIS2IH_SINGLE_LOW_PWR_4                    = 0x0B,
  AIS2IH_SINGLE_LOW_PWR_3                    = 0x0A,
  AIS2IH_SINGLE_LOW_PWR_2                    = 0x09,
  AIS2IH_SINGLE_LOW_PWR_12bit                = 0x08,
  AIS2IH_HIGH_PERFORMANCE_LOW_NOISE          = 0x14,
  AIS2IH_CONT_LOW_PWR_LOW_NOISE_4            = 0x13,
  AIS2IH_CONT_LOW_PWR_LOW_NOISE_3            = 0x12,
  AIS2IH_CONT_LOW_PWR_LOW_NOISE_2            = 0x11,
  AIS2IH_CONT_LOW_PWR_LOW_NOISE_12bit        = 0x10,
  AIS2IH_SINGLE_LOW_PWR_LOW_NOISE_4          = 0x1B,
  AIS2IH_SINGLE_LOW_PWR_LOW_NOISE_3          = 0x1A,
  AIS2IH_SINGLE_LOW_PWR_LOW_NOISE_2          = 0x19,
  AIS2IH_SINGLE_LOW_LOW_NOISE_PWR_12bit      = 0x18,
} ais2ih_mode_t;
int32_t ais2ih_power_mode_set(const stmdev_ctx_t *ctx,
                              ais2ih_mode_t val);
int32_t ais2ih_power_mode_get(const stmdev_ctx_t *ctx,
                              ais2ih_mode_t *val);

typedef enum
{
  AIS2IH_XL_ODR_OFF            = 0x00,
  AIS2IH_XL_ODR_1Hz6_LP_ONLY   = 0x01,
  AIS2IH_XL_ODR_12Hz5          = 0x02,
  AIS2IH_XL_ODR_25Hz           = 0x03,
  AIS2IH_XL_ODR_50Hz           = 0x04,
  AIS2IH_XL_ODR_100Hz          = 0x05,
  AIS2IH_XL_ODR_200Hz          = 0x06,
  AIS2IH_XL_ODR_400Hz          = 0x07,
  AIS2IH_XL_ODR_800Hz          = 0x08,
  AIS2IH_XL_ODR_1k6Hz          = 0x09,
  AIS2IH_XL_SET_SW_TRIG        = 0x12,  /* Use this only in SINGLE mode */
  AIS2IH_XL_SET_PIN_TRIG       = 0x22,  /* Use this only in SINGLE mode */
} ais2ih_odr_t;
int32_t ais2ih_data_rate_set(const stmdev_ctx_t *ctx, ais2ih_odr_t val);
int32_t ais2ih_data_rate_get(const stmdev_ctx_t *ctx,
                             ais2ih_odr_t *val);

int32_t ais2ih_block_data_update_set(const stmdev_ctx_t *ctx,
                                     uint8_t val);
int32_t ais2ih_block_data_update_get(const stmdev_ctx_t *ctx,
                                     uint8_t *val);

typedef enum
{
  AIS2IH_2g     = 0,
  AIS2IH_4g     = 1,
  AIS2IH_8g     = 2,
  AIS2IH_16g    = 3,
} ais2ih_fs_t;
int32_t ais2ih_full_scale_set(const stmdev_ctx_t *ctx, ais2ih_fs_t val);
int32_t ais2ih_full_scale_get(const stmdev_ctx_t *ctx,
                              ais2ih_fs_t *val);

int32_t ais2ih_status_reg_get(const stmdev_ctx_t *ctx,
                              ais2ih_status_t *val);

int32_t ais2ih_flag_data_ready_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  ais2ih_status_dup_t   status_dup;
  ais2ih_wake_up_src_t  wake_up_src;
  ais2ih_tap_src_t      tap_src;
  ais2ih_sixd_src_t     sixd_src;
  ais2ih_all_int_src_t  all_int_src;
} ais2ih_all_sources_t;
int32_t ais2ih_all_sources_get(const stmdev_ctx_t *ctx,
                               ais2ih_all_sources_t *val);

int32_t ais2ih_usr_offset_x_set(const stmdev_ctx_t *ctx, uint8_t *buff);
int32_t ais2ih_usr_offset_x_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t ais2ih_usr_offset_y_set(const stmdev_ctx_t *ctx, uint8_t *buff);
int32_t ais2ih_usr_offset_y_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t ais2ih_usr_offset_z_set(const stmdev_ctx_t *ctx, uint8_t *buff);
int32_t ais2ih_usr_offset_z_get(const stmdev_ctx_t *ctx, uint8_t *buff);

typedef enum
{
  AIS2IH_LSb_977ug    = 0,
  AIS2IH_LSb_15mg6    = 1,
} ais2ih_usr_off_w_t;
int32_t ais2ih_offset_weight_set(const stmdev_ctx_t *ctx,
                                 ais2ih_usr_off_w_t val);
int32_t ais2ih_offset_weight_get(const stmdev_ctx_t *ctx,
                                 ais2ih_usr_off_w_t *val);

int32_t ais2ih_temperature_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t ais2ih_acceleration_raw_get(const stmdev_ctx_t *ctx,
                                    int16_t *val);

int32_t ais2ih_device_id_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t ais2ih_auto_increment_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_auto_increment_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_reset_set(const stmdev_ctx_t *ctx);
int32_t ais2ih_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_boot_set(const stmdev_ctx_t *ctx);
int32_t ais2ih_boot_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  AIS2IH_XL_ST_DISABLE      = 0,
  AIS2IH_XL_ST_POSITIVE     = 1,
  AIS2IH_XL_ST_NEGATIVE     = 2,
} ais2ih_st_t;
int32_t ais2ih_self_test_set(const stmdev_ctx_t *ctx, ais2ih_st_t val);
int32_t ais2ih_self_test_get(const stmdev_ctx_t *ctx, ais2ih_st_t *val);

typedef enum
{
  AIS2IH_DRDY_LATCHED   = 0,
  AIS2IH_DRDY_PULSED    = 1,
} ais2ih_drdy_pulsed_t;
int32_t ais2ih_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                   ais2ih_drdy_pulsed_t val);
int32_t ais2ih_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                   ais2ih_drdy_pulsed_t *val);

