CoreMaker-lab/STM32C542CC_AIS2IH/STM32C542CC_AISIHTR_Project1/STM32C542CC_AISIHTR_Project1_cmake/ais2ih_reg.h
typedef enum
{
  AIS2IH_LPF_ON_OUT         = 0x00,
  AIS2IH_USER_OFFSET_ON_OUT  = 0x01,
  AIS2IH_HIGH_PASS_ON_OUT    = 0x10,
} ais2ih_fds_t;
int32_t ais2ih_filter_path_set(const stmdev_ctx_t *ctx,
                               ais2ih_fds_t val);
int32_t ais2ih_filter_path_get(const stmdev_ctx_t *ctx,
                               ais2ih_fds_t *val);

typedef enum
{
  AIS2IH_ODR_DIV_2     = 0,
  AIS2IH_ODR_DIV_4     = 1,
  AIS2IH_ODR_DIV_10    = 2,
  AIS2IH_ODR_DIV_20    = 3,
} ais2ih_bw_filt_t;
int32_t ais2ih_filter_bandwidth_set(const stmdev_ctx_t *ctx,
                                    ais2ih_bw_filt_t val);
int32_t ais2ih_filter_bandwidth_get(const stmdev_ctx_t *ctx,
                                    ais2ih_bw_filt_t *val);

int32_t ais2ih_reference_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_reference_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  AIS2IH_SPI_4_WIRE   = 0,
  AIS2IH_SPI_3_WIRE   = 1,
} ais2ih_sim_t;
int32_t ais2ih_spi_mode_set(const stmdev_ctx_t *ctx, ais2ih_sim_t val);
int32_t ais2ih_spi_mode_get(const stmdev_ctx_t *ctx, ais2ih_sim_t *val);

typedef enum
{
  AIS2IH_I2C_ENABLE    = 0,
  AIS2IH_I2C_DISABLE   = 1,
} ais2ih_i2c_disable_t;
int32_t ais2ih_i2c_interface_set(const stmdev_ctx_t *ctx,
                                 ais2ih_i2c_disable_t val);
int32_t ais2ih_i2c_interface_get(const stmdev_ctx_t *ctx,
                                 ais2ih_i2c_disable_t *val);

typedef enum
{
  AIS2IH_PULL_UP_CONNECT     = 0,
  AIS2IH_PULL_UP_DISCONNECT  = 1,
} ais2ih_cs_pu_disc_t;
int32_t ais2ih_cs_mode_set(const stmdev_ctx_t *ctx,
                           ais2ih_cs_pu_disc_t val);
int32_t ais2ih_cs_mode_get(const stmdev_ctx_t *ctx,
                           ais2ih_cs_pu_disc_t *val);

typedef enum
{
  AIS2IH_ACTIVE_HIGH  = 0,
  AIS2IH_ACTIVE_LOW   = 1,
} ais2ih_h_lactive_t;
int32_t ais2ih_pin_polarity_set(const stmdev_ctx_t *ctx,
                                ais2ih_h_lactive_t val);
int32_t ais2ih_pin_polarity_get(const stmdev_ctx_t *ctx,
                                ais2ih_h_lactive_t *val);

typedef enum
{
  AIS2IH_INT_PULSED   = 0,
  AIS2IH_INT_LATCHED  = 1,
} ais2ih_lir_t;
int32_t ais2ih_int_notification_set(const stmdev_ctx_t *ctx,
                                    ais2ih_lir_t val);
int32_t ais2ih_int_notification_get(const stmdev_ctx_t *ctx,
                                    ais2ih_lir_t *val);

typedef enum
{
  AIS2IH_PUSH_PULL   = 0,
  AIS2IH_OPEN_DRAIN  = 1,
} ais2ih_pp_od_t;
int32_t ais2ih_pin_mode_set(const stmdev_ctx_t *ctx,
                            ais2ih_pp_od_t val);
int32_t ais2ih_pin_mode_get(const stmdev_ctx_t *ctx,
                            ais2ih_pp_od_t *val);

int32_t ais2ih_pin_int1_route_set(const stmdev_ctx_t *ctx,
                                  ais2ih_ctrl4_int1_pad_ctrl_t *val);
int32_t ais2ih_pin_int1_route_get(const stmdev_ctx_t *ctx,
                                  ais2ih_ctrl4_int1_pad_ctrl_t *val);

int32_t ais2ih_pin_int2_route_set(const stmdev_ctx_t *ctx,
                                  ais2ih_ctrl5_int2_pad_ctrl_t *val);
int32_t ais2ih_pin_int2_route_get(const stmdev_ctx_t *ctx,
                                  ais2ih_ctrl5_int2_pad_ctrl_t *val);

int32_t ais2ih_all_on_int1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_all_on_int1_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_wkup_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_wkup_threshold_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_wkup_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_wkup_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  AIS2IH_HP_FEED           = 0,
  AIS2IH_USER_OFFSET_FEED  = 1,
} ais2ih_usr_off_on_wu_t;
int32_t ais2ih_wkup_feed_data_set(const stmdev_ctx_t *ctx,
                                  ais2ih_usr_off_on_wu_t val);
int32_t ais2ih_wkup_feed_data_get(const stmdev_ctx_t *ctx,
                                  ais2ih_usr_off_on_wu_t *val);

typedef enum
{
  AIS2IH_NO_DETECTION        = 0,
  AIS2IH_DETECT_ACT_INACT    = 1,
  AIS2IH_DETECT_STAT_MOTION  = 3,
} ais2ih_sleep_on_t;
int32_t ais2ih_act_mode_set(const stmdev_ctx_t *ctx,
                            ais2ih_sleep_on_t val);
int32_t ais2ih_act_mode_get(const stmdev_ctx_t *ctx,
                            ais2ih_sleep_on_t *val);

int32_t ais2ih_act_sleep_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_act_sleep_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_tap_threshold_x_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_tap_threshold_x_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_tap_threshold_y_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_tap_threshold_y_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  AIS2IH_XYZ    = 0,
  AIS2IH_YXZ    = 1,
  AIS2IH_XZY    = 2,
  AIS2IH_ZYX    = 3,
  AIS2IH_YZX    = 5,
  AIS2IH_ZXY    = 6,
} ais2ih_tap_prior_t;
int32_t ais2ih_tap_axis_priority_set(const stmdev_ctx_t *ctx,
                                     ais2ih_tap_prior_t val);
int32_t ais2ih_tap_axis_priority_get(const stmdev_ctx_t *ctx,
                                     ais2ih_tap_prior_t *val);

int32_t ais2ih_tap_threshold_z_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_tap_threshold_z_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_tap_detection_on_z_set(const stmdev_ctx_t *ctx,
                                      uint8_t val);
int32_t ais2ih_tap_detection_on_z_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t ais2ih_tap_detection_on_y_set(const stmdev_ctx_t *ctx,
                                      uint8_t val);
int32_t ais2ih_tap_detection_on_y_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t ais2ih_tap_detection_on_x_set(const stmdev_ctx_t *ctx,
                                      uint8_t val);
int32_t ais2ih_tap_detection_on_x_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

