CoreMaker-lab/STM32C542CC_AIS2IH/STM32C542CC_AISIHTR_Project1/STM32C542CC_AISIHTR_Project1_cmake/ais2ih_reg.h
int32_t ais2ih_tap_shock_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_tap_shock_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_tap_quiet_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_tap_quiet_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_tap_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_tap_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  AIS2IH_ONLY_SINGLE          = 0,
  AIS2IH_BOTH_SINGLE_DOUBLE   = 1,
} ais2ih_single_double_tap_t;
int32_t ais2ih_tap_mode_set(const stmdev_ctx_t *ctx,
                            ais2ih_single_double_tap_t val);
int32_t ais2ih_tap_mode_get(const stmdev_ctx_t *ctx,
                            ais2ih_single_double_tap_t *val);

int32_t ais2ih_tap_src_get(const stmdev_ctx_t *ctx,
                           ais2ih_tap_src_t *val);

int32_t ais2ih_6d_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_6d_threshold_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_6d_src_get(const stmdev_ctx_t *ctx,
                          ais2ih_sixd_src_t *val);

typedef enum
{
  AIS2IH_ODR_DIV_2_FEED   = 0,
  AIS2IH_LPF2_FEED        = 1,
} ais2ih_lpass_on6d_t;
int32_t ais2ih_6d_feed_data_set(const stmdev_ctx_t *ctx,
                                ais2ih_lpass_on6d_t val);
int32_t ais2ih_6d_feed_data_get(const stmdev_ctx_t *ctx,
                                ais2ih_lpass_on6d_t *val);

int32_t ais2ih_ff_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_ff_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  AIS2IH_FF_TSH_5LSb_FS2g  = 0,
  AIS2IH_FF_TSH_7LSb_FS2g  = 1,
  AIS2IH_FF_TSH_8LSb_FS2g  = 2,
  AIS2IH_FF_TSH_10LSb_FS2g = 3,
  AIS2IH_FF_TSH_11LSb_FS2g = 4,
  AIS2IH_FF_TSH_13LSb_FS2g = 5,
  AIS2IH_FF_TSH_15LSb_FS2g = 6,
  AIS2IH_FF_TSH_16LSb_FS2g = 7,
} ais2ih_ff_ths_t;
int32_t ais2ih_ff_threshold_set(const stmdev_ctx_t *ctx,
                                ais2ih_ff_ths_t val);
int32_t ais2ih_ff_threshold_get(const stmdev_ctx_t *ctx,
                                ais2ih_ff_ths_t *val);

int32_t ais2ih_fifo_watermark_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ais2ih_fifo_watermark_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  AIS2IH_BYPASS_MODE             = 0,
  AIS2IH_FIFO_MODE               = 1,
  AIS2IH_STREAM_TO_FIFO_MODE     = 3,
  AIS2IH_BYPASS_TO_STREAM_MODE   = 4,
  AIS2IH_STREAM_MODE             = 6,
} ais2ih_fmode_t;
int32_t ais2ih_fifo_mode_set(const stmdev_ctx_t *ctx,
                             ais2ih_fmode_t val);
int32_t ais2ih_fifo_mode_get(const stmdev_ctx_t *ctx,
                             ais2ih_fmode_t *val);

int32_t ais2ih_fifo_data_level_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_fifo_ovr_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ais2ih_fifo_wtm_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*AIS2IH_REGS_H */
